'''
Дан текстовий файл f, елементами якого є символи. Записати в файл g ті
компоненти файлу f, які є числами, а в файл h - буквами.
Виконав студент групи 122-А Андрощук Артем
'''

import string

file = open('f.txt', encoding='utf-8')  # відкриаємо файл для читання інформації
let = ""
num = ""
b = string.ascii_letters  # записуємо у змінну усі літери
c = '1234567890'  # записуємо у змінну усі числа
for row in file:  # проходимо по рядкам у файлі
    for letter in row:  # проходимо по символам у рядках
        if letter in b:  # перевіряємо чи це літера
            let += letter  # якщо так, то додаємо у змінну з літерами
        elif letter in c:  # перевіряємо чи це не цифра
            num += letter  # якшо так, то додаємо у змінну з цифрами
file.close()  # закриваємо перший файл
file2 = open('g.txt', 'w', encoding='utf-8')  # відкриваємо файл дл запису 1
file3 = open('h.txt', 'w', encoding='utf-8')  # відкриваємо файл дл запису 2
file2.writelines(num)  # записуємо у файл цифри
file3.writelines(let)  # записуємо у файл літери
